#######################
#######################
#######################
N = 10000
μ = [0,0]
Σ = [1 0; 0 1]
X = mvn_sample(μ,Σ,N)
X = [ones(N) X]
β0 = 4
β1 = 3
β2 = 1
σ = 10
σ2 = σ^2
ε = randn(N) * σ 
Y = β0 .+ β1 * X[:,2] .+ β2 * X[:,3] .+ ε
draw_coefficients(Y,X,σ2)

#######################
#######################
#######################
β = [β0, β1, β2]
draw_error_variance(Y,X,β)

#######################
#######################
#######################
draw_parameters(Y,X,σ2)

#######################
#######################
#######################
T = 1000
y = zeros(T+1)
e = zeros(T+1)
v = randn(T+1) * 5
for t in 2:(T+1)
    e[t] = 0.3 * e[t-1] + v[t] 
    y[t] = 0.5 + 0.2 * y[t-1] + e[t] 
end 
y = y[2:end]
e = e[2:end]
Y = y 
X = [ones(T) lag(Y)]
X = X[2:end,:]
Y = Y[2:end] 
σ2 = 5 
ϕ = [0.2]
draw_parameters(Y,X,ϕ,σ2)

iter = 15000
burnin = 12000
p = 1
#Eβ, Eϕ, Eσ2 = regress(Y,X,p,iter,burnin)
β, ϕ, σ2 = regress(Y,X,p,iter,burnin)